//--------------------------------------------------------
//! @file	ISystem.hpp
//! @brief  全てのSystemの基底クラスの定義
//! @author つきの
//--------------------------------------------------------
#pragma once
#include <entt/entt.hpp>
//--------------------------------------------------------
//! @class ISystem
//! @brief 全ての System の基底クラス
//--------------------------------------------------------
class ISystem {
public:
	//--------------------------------------------------------
	//! @brief デストラクタ
	//--------------------------------------------------------
	virtual ~ISystem() = default;

	//--------------------------------------------------------
	//! @brief System の更新処理
	//! @param registry [in,out] EnTT のレジストリ
	//! @param deltaTime [in] 前フレームからの経過時間
	//--------------------------------------------------------
	virtual void Update(entt::registry& registry, float deltaTime) = 0;
};